//《C语言从入门到精通》P235
// 第 7 章 指  针
// 7.3 二维数组与指针
// 45、使用指针输出二维数组的指定元素

#include<stdio.h>

int main()
{
	int A[5] = { 0,1,2,3,4 };
	int B[3][4] = { {0,1,2,3},{1,4,5,6},{2,7,8,9} };

	for (int i = 0; i < 5; i++)
	{
		printf("A[%d] = %d\n", i, A[i]);
	}
	printf("\n");

	for (int j = 0; j < 3; j++)
	{
		printf("B[%d] = { ", j);
		for (int k = 0; k < 4; k++)
		{
			printf("%d, ", B[j][k]);
		}
		printf("\b\b }\n");		// “\b\b”是为了删去每行第3个元素后多余的“, ”
	}

	printf("\n");

	printf("在一维数组中“A[0]”与“*(A+0)”等价，都表示引用首元素：\n");
	printf("· A[0] = %d\n", A[0]);
	printf("· *(A+0) = %d\n\n", *(A + 0));

	printf("从嵌套的角度，二维数组“B[3][4]”可以看作是一个由3个一维数组的元素是组成的（一维）数组”\n");
	printf("即“B[3][4]”相当于“B[3] = { b1[4], b2[4], b3[4] }”\n");
	printf("故与一维数组类比，“B[0]”与“*(B+0)”等价，也表示引用首元素，只不过此时首元素是一个一维数组“b1[3]”，故为其地址：\n");
	printf("故“B[0]”与“*(B+0)”为“b1[3]”的首地址，也是这个二维数组的首地址：\n");
	printf("· &B[0][0] = %p\n", &B[0][0]);
	printf("· B[0] = %p\n", B[0]);
	printf("· *(B+0) = %p\n", *(B + 0));

	printf("\n");

	printf("而如果要引用某个元素，还需要加上在b1[4]数组中的指针位移（即列下标），即如果令“p = *(B+0)（或：p = B[0]）”，则p+1是B[0][1]的地址\n");
	printf("简而言之，当用数组名引用二维数组指针的时候，“B[i]+j”等价于“*(B+i)+j”\n");

	printf("举例来说，如果要用数组名来引用二维数组的元素“B[2][3]”，可以用“*(B[2]+3)”或“*(*(B+2)+3)”：\n");
	printf("· B[2][3] = %d\n", B[2][3]);
	printf("· *(B[2]+3) = %d\n", *(B[2] + 3));
	printf("· *(*(B+2)+3) = %d\n", *(*(B + 2) + 3));
	printf("· *(B[0]+11) = %d\n", *(B[0] + 11));		// 另一种引用方法：首地址 + 该元素的序号，但IDE提示“警告”

	return 0;
}